#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # dnsimple_record.mx_1_hey will be created
  + resource "dnsimple_record" "mx_1_hey" {
      + domain    = "nathanherald.com"
      + domain_id = (known after apply)
      + hostname  = (known after apply)
      + id        = (known after apply)
      + priority  = "10"
      + ttl       = "3600"
      + type      = "MX"
      + value     = "work-mx.app.hey.com"
    }

  # dnsimple_record.mx_1_soverin will be destroyed
  - resource "dnsimple_record" "mx_1_soverin" {
      - domain    = "nathanherald.com" -> null
      - domain_id = "nathanherald.com" -> null
      - hostname  = "nathanherald.com" -> null
      - id        = "17207402" -> null
      - priority  = "1" -> null
      - ttl       = "3600" -> null
      - type      = "MX" -> null
      - value     = "mx.soverin.net" -> null
    }

  # dnsimple_record.mx_2_soverin will be destroyed
  - resource "dnsimple_record" "mx_2_soverin" {
      - domain    = "nathanherald.com" -> null
      - domain_id = "nathanherald.com" -> null
      - hostname  = "nathanherald.com" -> null
      - id        = "17207405" -> null
      - priority  = "2" -> null
      - ttl       = "3600" -> null
      - type      = "MX" -> null
      - value     = "mx02.soverin.net" -> null
    }

  # dnsimple_record.mx_3_soverin will be destroyed
  - resource "dnsimple_record" "mx_3_soverin" {
      - domain    = "nathanherald.com" -> null
      - domain_id = "nathanherald.com" -> null
      - hostname  = "nathanherald.com" -> null
      - id        = "17207412" -> null
      - priority  = "3" -> null
      - ttl       = "3600" -> null
      - type      = "MX" -> null
      - value     = "mx03.soverin.net" -> null
    }

Plan: 1 to add, 0 to change, 3 to destroy.
```

</details>

*Workflow: `terraform`, Action: `hashicorpterraform-github-actions2`, Working Directory: `.`, Workspace: `default`*
